/*******************************************************************************
*  skMonitorLCD - ＬＣＤにてデバッグモニターを行う関数ライブラリー             *
*                                                                              *
*    MonitorInit - デバッグモニターを行う為の初期化処理                        *
*    MonitorPutc - デバッグモニターに１文字を送信する処理                      *
*    MonitorPuts - デバッグモニターに文字列を送信する処理                      *
*    MonitorPutb - デバッグモニターに２進数で送信する処理                      *
*    MonitorPutd - デバッグモニターに１０進数で送信する処理                    *
*    MonitorPuth - デバッグモニターに１６進数で送信する処理                    *
*    MonitorCls  - デバッグモニター画面のクリアを行う処理                      *
*                                                                              *
*  note : LCDとPIC16F1827にて製作したデバッグモニタへデータを送信し表示させます*
*         製作したモニタのＰＩＣピン１番ピンに接続する                         *
*         １ピンの出力ポートから下記シリアル通信モドキで送り出します。         *
*         (ビットの送信タイミングにTimer2を使っています)                       *
*                                                                              *
*                  |--L--|-------H/L-------|--H--|       |--次のﾃﾞｰﾀ           *
*               ___      ________________________________      ____            *
*  ﾃﾞｰﾀのﾀｲﾐﾝｸﾞ    |_____|                 |     |       |_____|               *
*                  |-str-|-8ﾋﾞｯﾄﾃﾞｰﾀ D0-D7-|-stp-|       |-str-|               *
*                                                                              *
*  ｽﾄﾛｰﾌﾞ幅μs     |-104-|                       |--5ms--|←次ﾃﾞｰﾀまでの待時間 *
*                                                                              *
* ============================================================================ *
*   VERSION  DATE        BY             CHANGE/COMMENT                         *
* ---------------------------------------------------------------------------- *
*   1.01     2010-06-23  きむ茶工房     Create                                 *
*   2.00     2012-01-20  きむ茶工房     Putb/Putd/Puth/Cls 関数追加            *
*   3.00     2014-01-25  きむ茶工房     送信タイミングをTimer2に変更           *
*   3.01     2015-10-07  きむ茶工房     MPLAB X・XC8 V1.32用に書換え           *
* ============================================================================ *
*  PIC 12F1822 16F1827/1938 (このライブラリ自体は他のＰＩＣでもＯＫと思います) *
*  MPLAB IDE(V8.84) MPLAB X(v2.15)                                             *
*  MPLAB(R) XC8 C Compiler Version 1.00/1,32                                   *
*******************************************************************************/
#include <xc.h>
#include "skMonitorLCD.h"


/*******************************************************************************
*  MonitorInit()                                                               *
*    デバッグモニターを行う為の初期化処理                                      *
*******************************************************************************/
void MonitorInit()
{
     int i ;

     /* TIMER2の初期化処理を行う */
     MONITOR_PIN = 1;
     T2CON   = 0b00000001 ;       // TMR2プリスケーラ値を4倍、ポストスケーラ値は1:1の設定
     PR2     = BAUDRATE;          // ボーレート設定
     TMR2    = 0;                 // タイマ2リセット
     TMR2IF  = 0;                 // 割り込みフラグクリア
     /* LCDの起動を１秒間待つ    */
     for (i=0 ; i<100 ; i++) {
          __delay_ms(10) ;
     }
}
/*******************************************************************************
*  MonitorPutc(c)                                                              *
*    デバッグモニターに１文字を送信する処理                                    *
*                                                                              *
*    c : 表示する１文字を指定します                                            *
* ---------------------------------------------------------------------------- *
*  note : 数値の0x01～0x1fまでを送るとLCDのカーソル位置を設定します。          *
*         LCDのモジュールはSD1602HULB-XAを想定ししています。                   *
 _______________________________________________________________________________ 
|_01_|_02_|_03_|_04_|_05_|_06_|_07_|_08_|_09_|_0a_|_0b_|_0c_|_0d_|_0e_|_0f_|_10_|
|_11_|_12_|_13_|_14_|_15_|_16_|_17_|_18_|_19_|_1a_|_1b_|_1c_|_1d_|_1e_|_1f_|____|

*******************************************************************************/
void MonitorPutc(unsigned char code)
{
     char i , p ;

     p = 1;                       // ビット位置リセット
     // スタートビット出力
     MONITOR_PIN = 0;
     TMR2IF = 0 ;                 // 割り込みフラグクリア
     TMR2ON = 1 ;                 // TIMER2開始 
     // データビット出力
     for (i=0 ; i<8 ; i++) {
          while(!TMR2IF) ;                   // TMR2フラグ検出待ち
          TMR2IF = 0 ;                       // 割り込みフラグクリア
          MONITOR_PIN = (code & p)? 1: 0 ;   // データビット出力
          p <<= 1 ;                          // ビットシフト
     }
     // ストップビット出力
     while(!TMR2IF) ;
     TMR2IF = 0 ;
     MONITOR_PIN = 1 ;
     // 送信終了
     while(!TMR2IF) ;
     TMR2IF = 0 ;
     TMR2ON = 0 ;                 // TIMER2停止 
     __delay_ms(5) ;
}
/*******************************************************************************
*  MonitorPuts(s)                                                              *
*    デバッグモニターに文字列を送信する処理                                    *
*                                                                              *
*    s : 表示する文字列を指定します（NULLまで出力）                            *
*******************************************************************************/
void MonitorPuts(const char * s)
{
	while(*s) {
             MonitorPutc(*s++) ;
        }
}
/*******************************************************************************
*  MonitorPutb(c)                                                              *
*    デバッグモニターに２進数で送信する処理                                    *
*    １バイトの数値から２進数に変換してモニターへ出力します                    *
*                                                                              *
*    c : 表示する１バイトの数値を指定します                                    *
*                                                                              *
*******************************************************************************/
void MonitorPutb(unsigned char c)
{
     int i ;

     for (i=7 ; i>=0 ; i--) {
          if ( ((c >> i) & 0x1) == 1) MonitorPutc('1') ;
          else                        MonitorPutc('0') ;
     }
}
/*******************************************************************************
*  MonitorPutd(c)                                                              *
*    デバッグモニターに１０進数で送信する処理                                  *
*    １バイトの数値から１０進数に変換してモニターへ出力します                  *
*                                                                              *
*    c : 表示する１バイトの数値を指定します                                    *
*                                                                              *
*******************************************************************************/
void MonitorPutd(unsigned char c)
{
     int x , x1 , x2 ;

     x = c / 100 ;
     if (x != 0) {
          MonitorPutc(x+0x30) ;  // 百の位出力
          x = c % 100 ;
     } else x = c ;
     x1 = x / 10 ;
     if (x1 != 0){
          MonitorPutc(x1+0x30) ;  // 十の位出力
          x2 = x % 10 ;
     } else {
          MonitorPutc(x1+0x30) ;
          x2 = x ;
     }
     MonitorPutc(x2+0x30) ;       // 一の位出力
}
/*******************************************************************************
*  MonitorPuth(c)                                                              *
*    デバッグモニターに１６進数で送信する処理                                  *
*    １バイトの数値から１６進数に変換してモニターへ出力します                  *
*                                                                              *
*    c : 表示する１バイトの数値を指定します                                    *
*                                                                              *
*******************************************************************************/
void MonitorPuth(unsigned char c)
{
     const char HEX_Data[16] = {'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'} ;

     MonitorPutc(HEX_Data[ c >> 4 ]) ;
     MonitorPutc(HEX_Data[ c & 0x0F ]) ;
}
/*******************************************************************************
*  MonitorCls(num)                                                             *
*    デバッグモニター画面のクリアを行う処理                                    *
*                                                                              *
*    num : １指定で１行目をクリア、カーソルは１行目の先頭に移動します          *
*          ２指定で２行目をクリア、カーソルは２行目の先頭に移動します          *
*          それ以外の数値で全部クリア、カーソルは１行目の先頭に移動します      *
*                                                                              *
*******************************************************************************/
void MonitorCls(int num)
{
     const char cls_data[17] = { "                " } ;

     if (num != 1) {     // ２行目のクリア
          MonitorPutc(0x11) ;
          MonitorPuts(cls_data) ;
          MonitorPutc(0x11) ;
     }
     if (num != 2) {     // １行目のクリア
          MonitorPutc(0x01) ;
          MonitorPuts(cls_data) ;
          MonitorPutc(0x01) ;
     }
}
